app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
  def index
    @projects = Project.all

INSERT INTO `projects` (`job`, `job_description`, `po_number`, `manager`, `status`, `date`, `total`, `comment`, `created_at`, `updated_at`) VALUES ('asd', '', '', '', '', '', '', '', '2019-06-24 02:32:13', '2019-06-24 02:32:13')
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

DELETE FROM `projects` WHERE `projects`.`id` = 1
---
  def destroy
    @project.destroy

SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
    def set_project
      @project = Project.find(params[:id])